Revit 2025 API
ScheduleVerticalAlignment Enumeration
 Vertical alignment of data in a schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ScheduleVerticalAlignment
Public Enumeration ScheduleVerticalAlignment
public enum class ScheduleVerticalAlignment
type ScheduleVerticalAlignment
Members
Member name | Value | Description
Top | 0 |  Top aligned
Middle | 1 |  Middle aligned
Bottom | 2 |  Bottom aligned
See Also
Reference
Autodesk.Revit.DB Namespace